# Переменные и типы данных

# Идентификаторы. PEP8
# Буквы от a до Z
# Знак подчеркивания (_)
# Числа от 0 до 9
# Чувствителен к регистру (cat и Cat)

#Типы данных

#int (integer)
#str (string)
#list
#tuple (кортеж)
#dict (dictionary)


# Недопустимо использовать:
# Знаки препинания
# Спец. символы (@,%,$ и тд)

# Class
# _myprivate
# __init__

# Переменные

# переменная1 ----> Память | объект1 |
# переменная2 ----> Память | объект2 |

# MY_CONSTANT

# Типизация бывает:
# Статическая и динамическая
# Сильная (строгая) и слабая
# Python яаляется языком с сильной динамической типизацией.

# Числа - целые, вещественные, комлексные
# Контейнеры и последовательности:
    # Изменяемые (список, словарь, множество(set))    list , dist
    # Неизменяемые (Строки, кортежи, неизменяемое множество(frozenset)  : int string tuple , если меняем создаеться новый обьект
# NoneType - None (null)
